       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       PROCEDURE DIVISION.
           DISPLAY "Olá, COBOL no Linux!".
           STOP RUN.
