IDENTIFICATION DIVISION.
PROGRAM-ID. MEMORY-UNLOCK.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAVIO-ATIVO          PIC X(20) VALUE "GIL_EANES".
01 EMOCAO-PRINCIPAL     PIC X(10) VALUE "PERTENCER".
01 ITEM-SABOR-1         PIC X(20) VALUE "BOLO_CHOCOLATE_1.0".
01 ITEM-SABOR-2         PIC X(20) VALUE "GELADO_VERÃO_2025".
01 SENSORIAL-RESPONSE   PIC 9 VALUE 0.

PROCEDURE DIVISION.
INICIAR-REGISTO.
    DISPLAY "Memória Sensorial Detetada."
    PERFORM SENSORIAL-ATIVAR
    PERFORM VINCULOS-VALIDAR
    PERFORM SABORES-REGISTAR
    PERFORM FINALIZAR.

SENSORIAL-ATIVAR.
    DISPLAY "Cheiros antigos detectados. História viva."
    ADD 1 TO SENSORIAL-RESPONSE.

VINCULOS-VALIDAR.
    DISPLAY "Ligação emocional com COMPANHEIRO e família reconhecida."
    DISPLAY "EMOÇÃO ATIVA: " EMOCAO-PRINCIPAL.

SABORES-REGISTAR.
    DISPLAY "Sabores registados:"
    DISPLAY ITEM-SABOR-1
    DISPLAY ITEM-SABOR-2.

FINALIZAR.
    DISPLAY "MEMÓRIA GUARDADA COM SUCESSO."
    STOP RUN.
